Repository: nawroth/manual-french
Catalog: po/introduction.po
Languages: fr

source: This part gives a bird's eye view of what a graph database is, and then outlines some specifics of Neo4j.
fr: Cette partie offre un aperçu de ce qu'est une base de données graphe et souligne ensuite quelques spécificités de Neo4j.

source: Graph Database Concepts
fr: Concepts d'une base de données graphe

source: This chapter contains an introduction to the graph data model and also compares it to other data models used when persisting data.
fr: Ce chapitre contient une introduction au modèle de données en graphe et le compare également à d'autres modèles de données utilisés pour la persistance de données.

source: Neo4j Highlights
fr: Points forts de Neo4j

source: As a robust, scalable and high-performance database, Neo4j is suitable for full enterprise deployment or a subset of the full server can be used in lightweight projects.
fr: Définie comme une base de données robuste, évolutive et très performante, Neo4j convient aussi bien pour le deploiement en grande entreprise que pour les projets plus légers en utilisant une partie du serveur complet.

source: It features:
fr: Fonctionnalités:

source: true ACID transactions
fr: transactions ACID réelles

source: high availability
fr: haute disponibilité

source: scales to billions of nodes and relationships
fr: supporte jusqu'à des milliards de noeuds et relations

source: high speed querying through traversals
fr: requêtes ultra-rapides grâce aux traversées

source: Proper ACID behavior is the foundation of data reliability. Neo4j enforces that all operations that modify data occur within a transaction, guaranteeing consistent data. This robustness extends from single instance embedded graphs to multi-server high availability installations. For details, see <<transactions>>.
fr: Un comportement ACID sain est le fondement même de la fiabilité. Neo4j renforce cela en s'assurant que toutes les opérations modifiant les données soient exécutées au sein d'une transaction, garantissant la cohérence des données. Cette robustesse s'étend depuis une simple instance de graphe embarquée vers des installations multi-serveurs à haute disponibilité. Pour plus de détails, reportez-vous à <<transactions>>.

source: Reliable graph storage can easily be added to any application. A graph can scale in size and complexity as the application evolves, with little impact on performance. Whether starting new development, or augmenting existing functionality, Neo4j is only limited by physical hardware.
fr: Un système de stockage en graphe fiable peut facilement être ajouté à n'importe quelle application. Un graphe s'étend en taille et complexité au fur et à mesure que l'application évolue, avec de faibles impacts sur la performance. Pour le commencement d'un nouveau projet comme pour l'ajout de fonctionnalités existantes, Neo4j est adapté et n'est limité que par le matériel physique.

source: A single server instance can handle a graph of billions of nodes and relationships. When data throughput is insufficient, the graph database can be distributed among multiple servers in a high availability configuration. See <<ha>> to learn more.
fr: Une seule instance serveur peut traiter un graphe contenant des milliards de noeuds et relations. Quand le taux de transfert est insuffisant, la base de données graphe peut être distribuée sur plusieurs serveurs dans une configuration haute-disponibilité. Lisez <<ha>> pour en apprendre plus.

source: The graph database storage shines when storing richly-connected data. Querying is performed through traversals, which can perform millions of traversal steps per second. A traversal step resembles a _join_ in a RDBMS.
fr: Une base de données graphe brille quand elle stocke des données hautement connectées. Les requêtes sont exécutées à l'aide de traversées, qui peuvent procéder à plusieurs millions de traversées par seconde. Une traversée ressemble à une _jointure_ dans les bases de données relationnelles.

source: What is a Graph Database?
fr: Qu'est-ce qu'une base de données graphe?

source: A graph database stores data in a graph, the most generic of data structures, capable of elegantly representing any kind of data in a highly accessible way. Let’s follow along some graphs, using them to express graph concepts. We’ll ``read'' a graph by following arrows around the diagram to form sentences.
fr: Une base de données graphe stocke les données en graphe, structure de données la plus générique, capable de représenter avec élégance n'importe quel type de données d'une manière ultra accessible. Laissons nous guider le long de quelques graphes afin d'exprimer certains concepts. Nous "lirons" le graphe tout simplement en suivant ses flèches dans le diagramme afin de former des phrases.

source: A Graph contains Nodes and Relationships
fr: Un graphe contient des Noeuds et des Relations

source: ``A Graph —records data in-> Nodes —which have-> Properties''
fr: ``Un graphe —enregistre les données en-> Noeuds —qui contiennent des-> Propriétés''

source: The simplest possible graph is a single Node, a record that has named values referred to as Properties. A Node could start with a single Property and grow to a few million, though that can get a little awkward. At some point it makes sense to distribute the data into multiple nodes, organized with explicit Relationships.
fr: Le graphe le plus basique est un simple noeud, un enregistrement qui contient des valeurs nommées, ces noms sont référés comme Propriétés. Un Noeud peut partir avec une seule Propriété et grandir jusqu'à en contenir des millions, bien que cela puisse paraître un peu maladroit. A un certain point, il est évident de distribuer les données en multiples Noeuds organisés explicitement à l'aide de Relations.

source: "Graph" [fillcolor="NODEHIGHLIGHT"] "Graph" -> Nodes [label="records data in" weight=2.0] "Graph" -> Relationships [label="records data in" weight=2.0] Relationships -> Nodes [label="organize"] Nodes -> Properties [label="have"] Relationships -> Properties [label="have"]
fr: "Graphe" [fillcolor="NODEHIGHLIGHT"] "Graphe" -> Noeuds [label="enregistre les\n données en" weight=2.0] "Graphe" -> Relations [label="enregistre les\n données en" weight=2.0] Relations -> Noeuds [label="organise"] Noeuds -> Propriétés [label="contient"] Relations -> Propriétés [label="contient"]

source: Relationships organize the Graph
fr: Les Relations organisent le graphe

source: ``Nodes —are organized by-> Relationships —which also have-> Properties''
fr: ``Les Noeuds —sont organisés par des-> Relations —qui contiennent également des-> Propriétés''

source: Relationships organize Nodes into arbitrary structures, allowing a Graph to resemble a List, a Tree, a Map, or a compound Entity – any of which can be combined into yet more complex, richly inter-connected structures.
fr: Les Relations organisent les Noeuds en structures arbitraires, permettant à un Graphe de ressembler à une Liste, une Hiérarchie, une Carte ou une Entité composée -- chacune de ces ressemblances pouvant être combinées en une structure beaucoup plus complexe et richement connectée.

source: Query a Graph with a Traversal
fr: Interroger un Graphe à l'aide d'une Traversée

source: ``A Traversal —navigates-> a Graph; it —identifies-> Paths —which order-> Nodes''
fr: ``Une Traversée —navigue dans-> un Graphe; elle —identifie des-> Chemins —qui ordonnent les-> Noeuds''

source: A Traversal is how you query a Graph, navigating from starting Nodes to related Nodes according to an algorithm, finding answers to questions like ``what music do my friends like that I don't yet own,'' or ``if this power supply goes down, what web services are affected?''
fr: uUne Traversée est la manière dont vous interrogez un Graphe, naviguant depuis les Noeuds de départ vers les Noeuds reliés en accordance avec un algorithme, répondant à des questions ``Quelles chansons aiment mes amis mais que je ne possède pas?'' ou ``si cette génératrice d'énergie tombe en panne, quels services web sont affectés?''

source: Traversal [fillcolor="NODEHIGHLIGHT"] "Graph" [fillcolor="NODE2HIGHLIGHT"] Paths [fillcolor="NODE2HIGHLIGHT"] Algorithm [fillcolor="NODE2HIGHLIGHT"] Relationships -> Nodes [label="organize"] "Graph" -> Nodes [label="records data in"] "Graph" -> Relationships [label="records data in"] Traversal -> "Graph" [label="navigates" weight=2.0 color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Traversal -> Paths [label="identifies" weight=2.0 color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Traversal -> Algorithm [label="expresses" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Paths -> Nodes [label="order" weight=2.0]
fr: Traversée [fillcolor="NODEHIGHLIGHT"] "Graphe" [fillcolor="NODE2HIGHLIGHT"] Chemin [fillcolor="NODE2HIGHLIGHT"] Algorithme [fillcolor="NODE2HIGHLIGHT"] Relations -> Noeuds [label="organise"] "Graphe" -> Noeuds [label="enregistre les\ndonnées en"] "Graphe" -> Relations [label="enregistre les\ndonnées en"] Traversée -> "Graphe" [label="navigue" weight=2.0 color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Traversée -> Chemin [label="identifie" weight=2.0 color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Traversée -> Algorithme [label="exprime" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Chemin -> Noeuds [label="ordonne" weight=2.0]

source: Indexes look-up Nodes or Relationships
fr: Les indexs indentifient des Noeuds ou des Relations

source: ``An Index —maps from-> Properties —to either-> Nodes or Relationships''
fr: ``Un Index —relie des-> Properiétés —à des-> Noeuds ou Relations''

source: Often, you want to find a specific Node or Relationship according to a Property it has. Rather than traversing the entire graph, use an Index to perform a look-up, for questions like ``find the Account for username master-of-graphs.''
fr: Parfois vous voulez trouver un Noeud ou une Relation spécifique en accordance avec une Propriété qu'elle contient. Plutôt que de traverser un Graphe entier, utilisez un Index afin de procéder à une recherche comme ``trouver le Compte ayant comme nom d'utilisateur maître-des-graphes.''

source: Indexes [fillcolor="NODEHIGHLIGHT"] Relationships -> Nodes [label="organize"] Nodes -> Properties [label="have"] Relationships -> Properties [label="have"] Indexes -> Nodes [label="map to" weight=2.0] Indexes -> Relationships [label="map to" weight=2.0] Indexes -> Properties [label="map from" weight=2.0]
fr: Indexs [fillcolor="NODEHIGHLIGHT"] Relations -> Noeuds [label="organise"] Noeuds -> Propriétés [label="contient"] Relations -> Propriétés [label="contient"] Indexs -> Noeuds [label="relie à" weight=2.0] Indexs -> Relations [label="relie à" weight=2.0] Indexs -> Propriétés [label="relié des" weight=2.0]

source: Neo4j is a Graph Database
fr: Neo4j est une base de données Graphe

source: ``A Graph Database —manages a-> Graph and —also manages related-> Indexes''
fr: ``Une base de données Graphe —gère un-> Graphe et —gère aussi les-> Indexs''

source: Neo4j is a commercially supported open-source graph database. It was designed and built from the ground-up to be a reliable database, optimized for graph structures instead of tables. Working with Neo4j, your application gets all the expressiveness of a graph, with all the dependability you expect out of a database.
fr: Neo4j est une base de données graphe open-source supportée commercialement. Elle a été conceptualisée et construite depuis le début afin d'être une base de données fiable, optimisée pour les structures en graphe en place et lieu de tables. En travaillant avec Neo4j, votre application profite de toutes les expressivités d'un graphe tout en vous garantissant la fiabilité que vous attendez d'une base de données.

source: "Graph Database" [fillcolor="NODEHIGHLIGHT"] "Graph" [fillcolor="NODE2HIGHLIGHT"] Indexes [fillcolor="NODE2HIGHLIGHT"] Relationships -> Nodes [label="organize"] Nodes -> Properties [label="have"] Relationships -> Properties [label="have"] "Graph Database" -> "Graph" [label="manages" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] "Graph" -> Nodes [label="records data in"] "Graph" -> Relationships [label="records data in"] "Graph Database" -> Indexes [label="manages" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Indexes -> Nodes [label="map to"] Indexes -> Relationships [label="map to"] Indexes -> Properties [label="map from"] Traversal -> "Graph" [label="navigates"] Traversal -> Paths [label="identifies"] Traversal -> Algorithm [label="expresses"] Paths -> Nodes [label="order"]
fr: "Base de données Graphe" [fillcolor="NODEHIGHLIGHT"] "Graphe" [fillcolor="NODE2HIGHLIGHT"] Indexs [fillcolor="NODE2HIGHLIGHT"] Relations -> Noeuds [label="organisent"] Noeuds -> Propriétés [label="contient"] Relations -> Propriétés [label="contient"] "Base de données Graphe" -> "Graphe" [label="gère" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] "Graphe" -> Noeuds [label="enregistre les\ndonnées en"] "Graphe" -> Relations [label="enregistre les\ndonnées en"] "Base de données Graphe" -> Indexs [label="gère" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"] Indexs -> Noeuds [label="relie à"] Indexs -> Relations [label="relie à"] Indexs -> Propriétés [label="relie des"] Traversée -> "Graphe" [label="navigue"] Traversée -> Chemins [label="identifie"] Traversée -> Algorithme [label="exprime"] Chemins -> Noeuds [label="ordonne"]

source: Comparing Database Models
fr: Comparaison des modèles de données

source: A Graph Database stores data structured in the Nodes and Relationships of a graph. How does this compare to other persistence models? Because a graph is a generic structure, let's compare how a few models would look in a graph.
fr: Une base de données Graph stocke les données structurées dans les Noeuds et Relatins d'un graphe. Comment cela est-il comparé à d'autres modèles de persistance? Du fait qu'un graphe est une structure générique, comparons ce à quoi d'autres modèles auraient l'air dans un graphe.

source: A Graph Database transforms a RDBMS
fr: Une base de données graphe transforme un SGBDR

source: Topple the stacks of records in a relational database while keeping all the relationships, and you'll see a graph. Where an RDBMS is optimized for aggregated data, Neo4j is optimized for highly connected data.
fr: Renversez la pile d'enregistrements d'une base de données relationnelle et vous verrez un graphe. Là où un SGBDR est optimisé pour les données aggrégées, Neo4j est optimisé pour les données fortement connectées.

source: RDBMS
fr: SGBDR

source: include::graphs/graphdb-compare-rdbms.asciidoc[]
fr: image::graphdb-compare-rdbms.svg[scaledwidth="40%"]

source: Graph Database as RDBMS
fr: Base de données Graphe comme SGBDR

source: include::graphs/graphdb-compare-rdbms-g.asciidoc[]
fr: image::graphdb-compare-rdbms-g.svg[scaledwidth="100%"]

source: A Graph Database elaborates a Key-Value Store
fr: Une Base de données Graphe conçoit les Stockages Clé-Valeur

source: A Key-Value model is great for lookups of simple values or lists. When the values are themselves interconnected, you've got a graph. Neo4j lets you elaborate the simple data structures into more complex, interconnected data.
fr: Un modèle Clé-Valeur est très bien pour la recherche de simples valeurs ou de listes. Quand ces valeurs sont elle-mêmes interconnectées, vous obtenez un graphe. Neo4j vous laisse concevoir une simple structure de données en structure données interconnectées et plus complexes.

source: include::graphs/graphdb-compare-kvstore.asciidoc[]
fr: image::graphdb-compare-kvstore.svg[]

source: +K*+ represents a key, +V*+ a value. Note that some keys point to other keys as well as plain values.
fr: +K*+ représente une clé, +V*+ une valeur. Notez que certaines clés pointent vers d'autres clés comme vers des valeurs.

source: include::graphs/graphdb-compare-kvstore-g.asciidoc[]
fr: image::graphdb-compare-kvstore-g.svg[]

source: A Graph Database relates Column-Family
fr: Une Base de données Graphe conçoit les stockages Orientés Colonnes

source: Column Family (BigTable-style) databases are an evolution of key-value, using "families" to allow grouping of rows. Stored in a graph, the families could become hierarchical, and the relationships among data becomes explicit.
fr: La famille des stockages Orientés Colonnes (style BigTable) sont une évolution du modèle Clé-Valeur, utilisant des "familles" afin de grouper certaines lignes. Enregistrées dans un graphe, ces familles peuvent devenir hiérarchiques et les relations entre les données deviennent explicites.

source: A Graph Database navigates a Document Store
fr: Une Base de données Graphe navigue à travers un stockage orienté Documents

source: The container hierarchy of a document database accommodates nice, schema-free data that can easily be represented as a tree. Which is of course a graph. Refer to other documents (or document elements) within that tree and you have a more expressive representation of the same data. When in Neo4j, those relationships are easily navigable.
fr: L'hiérarchie en conteneur d'une base de données orientée document conçoit facilement les données non schématisées qui peuvent être représentées en Arbre, qui est évidemment un graphe. Référez-vous à d'autres documents (ou éléments de documents) au sein de ce même arbre et vous obtenez une représentation plus expressive de ces mêmes données. Dans Neo4j, ces relations sont facilement naviguables.

source: include::graphs/graphdb-compare-docdb.asciidoc[]
fr: image::graphdb-compare-docdb.svg[scaledwidth="75%"]

source: +D+=Document, +S+=Subdocument, +V+=Value, +D2/S2+ = reference to subdocument in (other) document.
fr: +D+=Document, +S+=Sousdocument, +V+=Valeur, +D2/S2+ = Référence à un Sousdocument dans un (autre) Document.

source: include::graphs/graphdb-compare-docdb-g.asciidoc[]
fr: image::graphdb-compare-docdb-g.svg[scaledwidth="75%"]

source: The Neo4j Graph Database
fr: La base de données Graphe Neo4j

source: This chapter goes into more detail on the data model and behavior of Neo4j.
fr: Ce chapître entre plus en détails dans le comportement et le modèle de données de Neo4j.

source: Nodes
fr: Noeuds

source: The fundamental units that form a graph are nodes and relationships. In Neo4j, both nodes and relationships can contain <<graphdb-neo4j-properties,properties>>.
fr: Les unités fondamentales composant un graphe sont les noeuds et relations. Dans Neo4j, aussi bien les noeuds que les relations peuvent contenir des <<graphdb-neo4j-properties,propriétés>>.

source: Nodes are often used to represent _entities,_ but depending on the domain relationships may be used for that purpose as well.
fr: Les noeuds sont souvent utilisés pour représenter des _entités_, mais en fonction de votre domaine des relations peuvent être utilisées pour cet usage.

source: "A Node" [fillcolor="NODEHIGHLIGHT"] "A Node" -> "Relationships" [label="can have"] "A Node" -> "Properties" [label="can have"]
fr: "Un Noeud" [fillcolor="NODEHIGHLIGHT"] "Un Noeud" -> "Relations" [label="peut avoir des"] "Un Noeud" -> "Propriétés" [label="peut avoir des"]

source: Let's start out with a really simple graph, containing only a single node with one property:
fr: Commençons avec un graphe super simple, contenant seulement un noeud avec une propriété:

source: Relationships
fr: Relations

source: Relationships between nodes are a key part of a graph database. They allow for finding related data. Just like nodes, relationships can have <<graphdb-neo4j-properties,properties>>.
fr: Les relations entre les noeuds sont un élément clé d'une base de données graphe. Elles permettent de trouvent les données reliées. Tout comme les noeuds, les relations peuvent avoir des <<graphdb-neo4j-properties,propriétés>>.

source: "A Relationship" [fillcolor="NODEHIGHLIGHT"] "A Relationship" -> "Start node" [label="has a"] "A Relationship" -> "End node" [label="has a"] "A Relationship" -> "Relationship type" [label="has a"] "A Relationship" -> "Properties" [label="can have"] "Relationship type" -> Name [label="uniquely identified by"]
fr: "Une Relation" [fillcolor="NODEHIGHLIGHT"] "Une Relation" -> "Noeud de départ" [label="a un"] "Une Relation" -> "Noeud d'arrivée" [label="a un"] "Une Relation" -> "Type de relation" [label="a un"] "Une Relation" -> "Properités" [label="peut avoir des"] "Type de Relation" -> Nom [label="identifié uniquement par un"]

source: A relationship connects two nodes, and is guaranteed to have valid start and end nodes.
fr: Une relation connecte deux noeuds en guarantissant d'avoir des noeuds de départ et d'arrivée valides.

source: graph [rankdir="LR"] "Start node" -> "End node" [label="relationship"]
fr: graph [rankdir="LR"] "Noeud de départ" -> "Noeud d'arrivée" [label="relation"]

source: As relationships are always directed, they can be viewed as outgoing or incoming relative to a node, which is useful when traversing the graph:
fr: Du fait que les relations sont toujours directionnelles, elles peuvent être visualisées comme entrantes ou sortantes d'un noeud, ce qui est utile quand on traverse un graphe:

source: graph [rankdir="LR"] START [label=""] MIDDLE [label="Node" fillcolor="NODEHIGHLIGHT"] END [label=""] MIDDLE -> END [label="outgoing relationship"] START -> MIDDLE [label="incoming relationship"]
fr: graph [rankdir="LR"] START [label=""] MIDDLE [label="Noeud" fillcolor="NODEHIGHLIGHT"] END [label=""] MIDDLE -> END [label="relation sortante"] START -> MIDDLE [label="relation entrante"]

source: 'Relationships are equally well traversed in either direction.' This means that there is no need to add duplicate relationships in the opposite direction (with regard to traversal or performance).
fr: 'Les relations sont traversées aussi efficacement dans n'importe quelle direction.' Cela signifie qu'il est nullement nécessaire d'ajouter un duplicata de la relation dans le sens opposé (en rapport avec les traversées ou la performance).

source: While relationships always have a direction, you can ignore the direction where it is not useful in your application.
fr: Bien que les relations ont toujours une direction, vous pouvez ignorer cette direction quand cela n'est pas nécessaire dans votre application.

source: Note that a node can have relationships to itself as well:
fr: Notez qu'un noeud peut également avoir des relations vers lui-même:

source: "Node" -> "Node" [label="loop"]
fr: "Noeud" -> "Noeud" [label="boucle"]

source: To further enhance graph traversal all relationships have a relationship type. Note that the word _type_ might be misleading here, you could rather think of it as a _label_. The following example shows a simple social network with two relationship types.
fr: Pour améliore encore plus la traversée d'un graphe, toutes les relations ont un type de relation. Notez que le terme _type_ peut être ambigü ici, vous pouvez plutôt penser à une _étiquette_. Les exemples suivants montrent un réseau social simple avec deux relations.

source: Maja -> Oscar [label="follows"] Oscar -> Maja [label="follows"] Alice -> Oscar [label="follows"] Oscar -> William [label="blocks" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"]
fr: Maja -> Oscar [label="suit"] Oscar -> Maja [label="suit"] Alice -> Oscar [label="suit"] Oscar -> William [label="bloque" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"]

source: Using relationship direction and type
fr: Utilisation d'une direction et type de relation
