Repository: nawroth/manual-french
Catalog: po/introduction.po
Languages: fr

source: | What | How | get who a person follows | outgoing +follows+ relationships, depth one | get the followers of a person | incoming +follows+ relationships, depth one | get who a person blocks | outgoing +blocks+ relationships, depth one | get who a person is blocked by | incoming +blocks+ relationships, depth one
fr: | Quoi | Comment | savoir qui une personne suit | relations +suit+ sortantes, profondeur un | savoir les abonnés d'une personne | relations +suit+ entrantes, profondeur un | savoir qui une personne bloque | relations +bloque+ sortantes, profondeur un | savoir par qui une personne est bloquée | relations +bloque+ entrantes, profondeur un

source: This example is a simple model of a file system, which includes symbolic links:
fr: Cet exemple est un modèle simple d'un système de fichiers, qui inclut des liens symboliques:

source: "/" [ fillcolor="NODEHIGHLIGHT"] "/" -> A A -> B [label="file"] A -> C [label="file"] C -> D [label="file"] B -> D [label="symbolic link \n{name: \"E\"}" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"]
fr: "/" [ fillcolor="NODEHIGHLIGHT"] "/" -> A A -> B [label="fichier"] A -> C [label="fichier"] C -> D [label="fichier"] B -> D [label="lien symbolique \n{nom: \"E\"}" color="EDGEHIGHLIGHT" fontcolor="EDGEHIGHLIGHT"]

source: Depending on what you are looking for, you will use the direction and type of relationships during traversal.
fr: En fonction de ce que vous recherchez, vous utiliserez les directions et types de relations pendant les traversées.

source: |What | How |get the full path of a file | incoming +file+ relationships |get all paths for a file | incoming +file+ and +symbolic link+ relationships |get all files in a directory | outgoing +file+ and +symbolic link+ relationships, depth one |get all files in a directory, excluding symbolic links | outgoing +file+ relationships, depth one |get all files in a directory, recursively | outgoing +file+ and +symbolic link+ relationships
fr: |Quoi | Comment |chemin complet d'un fichier | relations +fichier+ entrantes |tous les chemins d'un fichier | relations +fichier+ et +lien symbolique+ entrantes |tous les fichiers d'un dossier | relations +fichier+ et +lien symbolique+ sortantes, profondeur un |tous les fichiers d'un dossier, sauf les liens symboliques | relations +fichier+ sortantes, profondeur un |tous les fichiers d'un dossier, récursivement | relations +fichier+ et +lien symbolique+

source: Properties
fr: Propriétés

source: Both nodes and relationships can have properties.
fr: Aussi bien les noeuds que les relations peuvent contenir des propriétés.

source: Properties are key-value pairs where the key is a string. Property values can be either a primitive or an array of one primitive type. For example +String+, +int+ and +int[]+ values are valid for properties.
fr: Les propriétés sont des paires clé-valeur où les clés sont des chaînes des caractères. Les valeurs peuvent être aussi bien primitives ou un tableau de types primitives. Par exemple les valeurs +String+, +int+ et +int[]+ sont des propriétés valides.

source: +null+ is not a valid property value. Nulls can instead be modeled by the absence of a key.
fr: +null+ n'est pas une valeur de propriété valide. Null peut être modélisé par l'absence d'une clé.

source: "A Property" [fillcolor="NODEHIGHLIGHT"] "A Property" -> Key [label="has a"] Key -> Primitive:String [label="is a"] "A Property" -> Value [label="has a"] Value -> Primitive [label="can be a"] Value -> Primitive [label="can be an array of"] Primitive [shape="record" label="Primitive |{boolean|byte|short|int|long|float|double|char|<String>String}"]
fr: "Une Propriété" [fillcolor="NODEHIGHLIGHT"] "Une Propriété" -> Clé [label="a une"] Clé -> Primitive:String [label="est une"] "Une Propriété" -> Valeur [label="a une"] Valeur -> Primitive [label="peut être une"] Valeur -> Primitive [label="peut être un tableau de"] Primitive [shape="record" label="Primitives |{boolean|byte|short|int|long|float|double|char|<String>String}"]

source: Property value types
fr: Type de valeurs de propriétés

source: |Type | Description | Value range |boolean| | +true+/+false+ |byte|8-bit integer | +-128+ to +127+, inclusive |short|16-bit integer | +-32768+ to +32767+, inclusive |int| 32-bit integer | +-2147483648+ to +2147483647+, inclusive |long| 64-bit integer | +-9223372036854775808+ to +9223372036854775807+, inclusive |float| 32-bit IEEE 754 floating-point number | |double| 64-bit IEEE 754 floating-point number | |char| 16-bit unsigned integers representing Unicode characters | +u0000+ to +uffff+ (+0+ to +65535+) |String| sequence of Unicode characters |
fr: |Type | Déscription | rayon de valeurs |boolean| | +true+/+false+ |byte|8-bit integer | +-128+ to +127+, inclus |short|16-bit integer | +-32768+ to +32767+, inclus |int| 32-bit integer | +-2147483648+ to +2147483647+, inclus |long| 64-bit integer | +-9223372036854775808+ to +9223372036854775807+, inclus |float| 32-bit IEEE 754 nombre à virgule flottante | |double| 64-bit IEEE 754 nombre à virgule flottante | |char| 16-bit entiers non-signés représentant des caractères Unicode | +u0000+ à +uffff+ (+0+ à +65535+) |String| séquence de caractères Unicode |

source: For further details on float/double values, see http://docs.oracle.com/javase/specs/jls/se5.0/html/typesValues.html#4.2.3[Java Language Specification].
fr: Pour plus de détails sur les valeurs flottantes/doubles, voyez http://docs.oracle.com/javase/specs/jls/se5.0/html/typesValues.html#4.2.3[Java Language Specification].

source: Paths
fr: Chemins

source: A path is one or more nodes with connecting relationships, typically retrieved as a query or traversal result.
fr: Un chemin est un ou plusieurs noeuds avec des relations connectées, généralement récupérés comme résultat d'une requête ou traversée.

source: "A Path" [fillcolor="NODEHIGHLIGHT"] "A Path" -> "Start Node" [label="has a"] "A Path" -> "Relationship" [label="can contain one or more"] "Relationship" -> "Node" [label="accompanied by a"] "A Path" -> "End Node" [label="has an"]
fr: "Un Chemin" [fillcolor="NODEHIGHLIGHT"] "Un Chemin" -> "Noeud de départ" [label="a un"] "Un Chemin" -> "Relations" [label="contient une ou plusieurs"] "Relations" -> "Noeud" [label="accompagnées par un"] "Un Chemin" -> "Noeud d'arrivée" [label="a un"]

source: The shortest possible path has length zero and looks like this:
fr: Le chemin le plus court possible a une longueur de zéro et ressemble à cela:

source: "Node"
fr: "Noeud"

source: A path of length one:
fr: Un chemin de longueur un:

source: "Node 1" -> "Node 2" [label="Relationship 1"]
fr: "Noeud 1" -> "Noeud 2" [label="Relation 1"]

source: Traversal
fr: Traversées

source: Traversing a graph means visiting its nodes, following relationships according to some rules. In most cases only a subgraph is visited, as you already know where in the graph the interesting nodes and relationships are found.
fr: Traverser un graphe signifie visiter ses noeuds et suivre ses relations, cela en accordance avec certaines règles. Dans la plupart des cas, seulement un sous-graphe est visité du fait que vous connaissez déjà dans quelle partie du graphe se trouvent les noeuds et relations qui vous intéressent.

source: Neo4j comes with a callback based traversal API which lets you specify the traversal rules. At a basic level there's a choice between traversing breadth- or depth-first.
fr: Neo4j est fourni avec une API basée sur des callbacks, ce qui vous laisse la possibilité de spécifier les règles pour les traversées. A un niveau basique, vous avez le choix entre les traversées ``breadth'' ou ``depth-first''.

source: For an in-depth introduction to the traversal framework, see <<tutorial-traversal>>. For Java code examples see <<tutorials-java-embedded-traversal>>.
fr: Pour une introduction plus en détails du framework de traversées, voyez le <<tutorial-traversal>>. Pour des exemples de code Java, voyez <<tutorials-java-embedded-traversal>>.

source: Other options to traverse or query graphs in Neo4j are <<cypher-query-lang, Cypher>> and <<gremlin-plugin, Gremlin>>.
fr: Les autres options pour traverser ou interroger un graphe dans Neo4j sont <<cypher-query-lang, Cypher>> et <<gremlin-plugin, Gremlin>>.
